-------------------------------------------------------------------------
--  StockSharp QUIK Lua Fix Server (c) 2015 http://stocksharp.com      --
-------------------------------------------------------------------------

-- Для изменения настроек раскоментируйте строку параметра.

-------------------------------------------------------------------------
--  Настройки логирования
-------------------------------------------------------------------------
-- Уровень логирования.
-- 1 - Debug
-- 2 - Info
-- 3 - Warning
-- 4 - Error
LogLevel=2

-- Название текстового файла, в который будут сохраняться лог-сообщения.
-- LogFile="StockSharp.QuikLua.log"
-------------------------------------------------------------------------

-------------------------------------------------------------------------
--  Настройки QUIK Lua Fix сервера
-------------------------------------------------------------------------
-- Адрес, на котором FIX сервер будет обрабатывать транзакции.
-- TransactionAddress="127.0.0.1:5001"

-- Адрес, на котором FIX сервер будет рассылать маркет-данные.
-- MarketDataAddress="127.0.0.1:5001"

-- Логин, с которым разрешено подключение к FIX серверу.
-- Если логин не указан, разрешаются подключения с любым
-- пользователем и паролем (включая нескольких пользователей).
-- ServerLogin="quik"

-- Пароль, с которым разрешено подключение к FIX серверу.
-- ServerPassword="quik"
-------------------------------------------------------------------------

-------------------------------------------------------------------------
--  Настройки маркет-данных
-------------------------------------------------------------------------
-- Отправлять изменения по стакану. Если выключено, отправляется
-- стакан целиком.
-- По умолчанию, включено.
-- IncrementalDepthUpdates=false
-------------------------------------------------------------------------

-------------------------------------------------------------------------
--  Общие настройки Lua (не изменять)
-------------------------------------------------------------------------
package.path = ""
package.cpath = getScriptPath() .. "\\StockSharp.QuikLua.dll"

require("StockSharp")
-------------------------------------------------------------------------