-------------------------------------------------------------------------
--  StockSharp QUIK Lua Fix Server (c) 2015 http://stocksharp.com      --
-------------------------------------------------------------------------

-------------------------------------------------------------------------
--  Настройки логирования
-------------------------------------------------------------------------
-- Уровень логирования.
-- 1 - Debug
-- 2 - Info
-- 3 - Warning
-- 4 - Error
LogLevel=2

-- Название текстового файла (без расширения), 
-- в который будут сохраняться лог-сообщения.
-- LogFile="StockSharp.QuikLua"

-- Отправлять изменения по стакану. Если выключено, отправляется стакан целиком.
-- По умолчанию, включено.
-- IncrementalDepthUpdates=false
-------------------------------------------------------------------------

-------------------------------------------------------------------------
--  Настройки QUIK Lua Fix сервера
-------------------------------------------------------------------------
-- Для изменения настроек раскоментируйте строку параметра.

-- Серверный порт, на котором будет работать FIX сервер.
-- Если порт не указан, используется значение 5001.
-- ServerPort=5001

-- Логин, с которым разрешено подключение к FIX серверу.
-- Если логин не указан, разрешаются подключения с любым
-- пользователем и паролем (включая нескольких пользователей).
-- ServerLogin="quik"

-- Пароль, с которым разрешено подключение к FIX серверу.
-- ServerPassword="quik"
-------------------------------------------------------------------------

-------------------------------------------------------------------------
--  Общие настройки Lua (не изменять)
-------------------------------------------------------------------------
package.path = ""
package.cpath = getScriptPath() .. "\\StockSharp.QuikLua.dll"

require("StockSharp")
-------------------------------------------------------------------------